{"keras_version": "2.0.4", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_3", "batch_input_shape": [null, 28, 140, 1], "dtype": "float32", "sparse": false}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "filters": 10, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "conv2d_5", "padding": "same", "kernel_constraint": null}}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "padding": "same"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "trainable": true, "filters": 40, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "conv2d_7", "padding": "same", "kernel_constraint": null}}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6", "padding": "same"}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_6"}}, {"name": "dense_7", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_7"}}, {"name": "dense_8", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_8"}}, {"name": "dense_9", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_9"}}, {"name": "dense_10", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_10"}}], "output_layers": [["dense_6", 0, 0], ["dense_7", 0, 0], ["dense_8", 0, 0], ["dense_9", 0, 0], ["dense_10", 0, 0]], "input_layers": [["input_3", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}