{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 28, 140, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_7", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "name": "conv2d_7", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "name": "conv2d_8", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_9", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "name": "conv2d_9", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "name": "conv2d_10", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "max_pooling2d_5", "config": {"trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_11", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "name": "conv2d_11", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"trainable": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "name": "conv2d_12", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "max_pooling2d_6", "config": {"trainable": true, "padding": "same", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_6"}}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dropout_2", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_6", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "name": "dense_6", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_7", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "name": "dense_7", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_8", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "name": "dense_8", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_9", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "name": "dense_9", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_10", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "name": "dense_10", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_2", "output_layers": [["dense_6", 0, 0], ["dense_7", 0, 0], ["dense_8", 0, 0], ["dense_9", 0, 0], ["dense_10", 0, 0]], "input_layers": [["input_2", 0, 0]]}}