{"class_name": "Model", "keras_version": "2.0.4", "config": {"output_layers": [["dense_6", 0, 0], ["dense_7", 0, 0], ["dense_8", 0, 0], ["dense_9", 0, 0], ["dense_10", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 140, 1], "dtype": "float32", "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "filters": 10, "kernel_regularizer": null, "name": "conv2d_4", "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "same", "name": "max_pooling2d_4", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "filters": 40, "kernel_regularizer": null, "name": "conv2d_6", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "same", "name": "max_pooling2d_6", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 11, "use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_6"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_6"}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 11, "use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_7"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_7"}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 11, "use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_8"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_8"}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 11, "use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_9"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_9"}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 11, "use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_10"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_10"}], "input_layers": [["input_2", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}