{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 28, 140, 1], "name": "input_2", "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "filters": 30, "name": "conv2d_5", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "filters": 30, "name": "conv2d_6", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "filters": 15, "name": "conv2d_7", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "filters": 15, "name": "conv2d_8", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Flatten", "name": "flatten_2", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "name": "dense_6", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 11, "activity_regularizer": null, "bias_constraint": null, "name": "dense_6"}}, {"class_name": "Dense", "name": "dense_7", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 11, "activity_regularizer": null, "bias_constraint": null, "name": "dense_7"}}, {"class_name": "Dense", "name": "dense_8", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 11, "activity_regularizer": null, "bias_constraint": null, "name": "dense_8"}}, {"class_name": "Dense", "name": "dense_9", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 11, "activity_regularizer": null, "bias_constraint": null, "name": "dense_9"}}, {"class_name": "Dense", "name": "dense_10", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 11, "activity_regularizer": null, "bias_constraint": null, "name": "dense_10"}}], "name": "model_2", "output_layers": [["dense_6", 0, 0], ["dense_7", 0, 0], ["dense_8", 0, 0], ["dense_9", 0, 0], ["dense_10", 0, 0]], "input_layers": [["input_2", 0, 0]]}}